In [5]:
# Importing Numpy and Pandas
import numpy as np
import pandas as pd

In [ ]:
Exercise 1

In [7]:
# creating a numpy array containing numbers from 1 to 10 , then reshape it to 2*5 matrix

array1 = np.arange(1,11)
print('The array1:',array1)

reshaped_array1 = array1.reshape(2,5)
print("\nReshaped 2*5 matrix:\n",reshaped_array1)

The array1: [ 1  2  3  4  5  6  7  8  9 10]

Reshaped 2*5 matrix:
 [[ 1  2  3  4  5]
 [ 6  7  8  9 10]]

In [ ]:
Exercise 2

In [9]:
# Creating a numpy array containing numbers from 1 to 20, then extract the elements 5 to 15 index

array2 = np.arange(1,21)
print('The array2:',array2)

extracted = array2[5:15]
print('\nElements between 5th and 15th index:',extracted)

The array2: [ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]

Elements between 5th and 15th index: [ 6  7  8  9 10 11 12 13 14 15]

In [ ]:
Exercise 3

In [11]:
# Creating a pandas series and add a new item to the series

fruit_series = pd.Series ({'apples': 3, 'bananas': 2, 'oranges': 1 })
print('original_series:')
print(fruit_series)

fruit_series['pears'] = 4
print('\nupdated series:')
print(fruit_series)

original_series:
apples     3
bananas    2
oranges    1
dtype: int64

updated series:
apples     3
bananas    2
oranges    1
pears      4
dtype: int64

In [ ]:
Exercise 4

In [13]:
# Creating dataframe with 10 rows of sample data
persons_data = {
    'name': ['Tony', 'Scarlet', 'Odins', 'Chris', 'Peter', 'Banner', 'Natasha', 'Shalin', 'Ivanya', 'Steve'],
    'age': [25, 30, 22, 35, 40, 29, 32, 26, 27, 38],
    'gender': ['M', 'F', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'M']}

df = pd.DataFrame(persons_data)
print('DataFrame with 10 rows:')
df

DataFrame with 10 rows:

      name  age gender
0     Tony   25      M
1  Scarlet   30      F
2    Odins   22      M
3    Chris   35      M
4    Peter   40      M
5   Banner   29      M
6  Natasha   32      F
7   Shalin   26      F
8   Ivanya   27      F
9    Steve   38      M

In [ ]:
Exercise 5

In [15]:
# Adding new column to the dataframe 

df['occupation'] = ['Programmer', 'Manager', 'Analyst', 'Programmer', 'Manager', 'Analyst', 'Programmer', 'Manager', 'Analyst', 'Programmer']
print('DataFrame after adding occupation Column:')
df

DataFrame after adding occupation Column:

      name  age gender  occupation
0     Tony   25      M  Programmer
1  Scarlet   30      F     Manager
2    Odins   22      M     Analyst
3    Chris   35      M  Programmer
4    Peter   40      M     Manager
5   Banner   29      M     Analyst
6  Natasha   32      F  Programmer
7   Shalin   26      F     Manager
8   Ivanya   27      F     Analyst
9    Steve   38      M  Programmer

In [ ]:
Exercise 6

In [17]:
# Filtering the persons by age is greater than or equal to 30

filtered_age = df[df['age']>=30]
print('Peoples with age above 30:')
filtered_age

Peoples with age above 30:

      name  age gender  occupation
1  Scarlet   30      F     Manager
3    Chris   35      M  Programmer
4    Peter   40      M     Manager
6  Natasha   32      F  Programmer
9    Steve   38      M  Programmer

In [ ]:
Exercise 7

In [19]:
# Saving the dataframe into a csv file and read that file 

df.to_csv('Employees_data_Avng.csv', index = False)
print("DataFrame saved sucessfully as csv file")

df_read = pd.read_csv('Employees_data_Avng.csv')
print('Read and displaying the saved csv file')
df_read

DataFrame saved sucessfully as csv file
Read and displaying the saved csv file

      name  age gender  occupation
0     Tony   25      M  Programmer
1  Scarlet   30      F     Manager
2    Odins   22      M     Analyst
3    Chris   35      M  Programmer
4    Peter   40      M     Manager
5   Banner   29      M     Analyst
6  Natasha   32      F  Programmer
7   Shalin   26      F     Manager
8   Ivanya   27      F     Analyst
9    Steve   38      M  Programmer